:PROPERTIES:
:ID:       6254A9CC-22CD-4480-9BB9-F8981EC81D5A
:END:
#+title: Operating System
#+HUGO_SECTION:main
The Info comes most from MITOCW

* the Dinosaur book
:LOGBOOK:
CLOCK: [2022-04-03 Sun 15:03]--[2022-04-03 Sun 15:22] =>  0:19
CLOCK: [2022-04-03 Sun 11:47]--[2022-04-03 Sun 12:03] =>  0:16
:END:
** Processes
:LOGBOOK:
CLOCK: [2022-04-05 Tue 14:00]--[2022-04-05 Tue 14:41] =>  0:41
CLOCK: [2022-04-05 Tue 11:49]--[2022-04-05 Tue 12:19] =>  0:30
CLOCK: [2022-04-03 Sun 16:15]--[2022-04-03 Sun 17:08] =>  0:53
CLOCK: [2022-04-03 Sun 15:22]--[2022-04-03 Sun 16:05] =>  0:43
:END:
*** TODO reading xv6 ch1
:LOGBOOK:
- Note taken on [2022-04-19 Tue 12:55] \\
  sleep.c completed, raised a page fault
- Note taken on [2022-04-19 Tue 11:32] \\
  读完第一遍
CLOCK: [2022-04-19 Tue 11:20]--[2022-04-19 Tue 12:55] =>  1:35
:END:
